am/OpenFOAM-10/etc/templates/inflowOutflowRotating/system/nonCouplePatchFields
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      nonCouplePatchFields;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U
{
    type            movingWallSlipVelocity;
    value           uniform (0 0 0);
}

nut
{
    type            calculated;
    value           uniform 0;
}

"(p|k|omega|epsilon)"
{
    type            zeroGradient;
}

// ************************************************************************* //
